{
  "backend/main.mo": "Motoko actor defining a Disease type and a hardcoded map of rice diseases (Bacterial Blight, Sheath Blight, Blast, Tungro, etc.) with fields for treatment, fertilizers, prevention tips, severity, yield impact, and quick actions.",
  "feature_evidence.json": "Feature evidence report confirming that the 'Made with caffeine.ai' attribution was removed from the footer in frontend/src/components/Layout.tsx, mapped to test ID REQ-18.",
  "frontend-file-summaries.txt": "JSON document providing one-line summaries of each frontend source file, serving as a quick reference for the purpose and behavior of each component, hook, and config file.",
  "frontend/index.css": "Tailwind CSS entry file that defines OKLCH-based CSS custom properties for light and dark themes, including colors for background, foreground, primary, destructive, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, setting the page title to 'Paddy Disease Detection' and mounting the React root via src/main.tsx.",
  "frontend/src/App.tsx": "Root React component that wraps DetectionPage inside the Layout component and provides a configured React Query QueryClient.",
  "frontend/src/components/DiseaseResult.tsx": "Disease result display card that renders detected disease name, color-coded severity badge, yield impact, treatment steps, fertilizers, prevention tips, seasonal advice, and an urgent Quick Actions banner using backend Disease data.",
  "frontend/src/components/ImageUploader.tsx": "Drag-and-drop image upload component with file preview, remove button, analyze trigger, loading state, and an optional amber warning banner for invalid (non-paddy) images.",
  "frontend/src/components/Layout.tsx": "Full-page layout shell with a forest-green header showing the PaddyScan brand and a footer with a dynamic copyright year, with no caffeine.ai attribution.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using an authenticated identity when available or falling back to an anonymous actor, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useImageUpload.ts": "Custom React hook that manages image file selection, drag-and-drop, preview URL generation, and base64 encoding with validation for type and size limits.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and context provider for Internet Computer Internet Identity authentication, exposing login/logout functions and identity state via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides a `useDetectDisease` mutation hook that checks if an uploaded image is plant-like via pixel analysis, then calls the backend actor to simulate disease detection.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, imports Inter and Outfit fonts, and defines a nature-inspired OKLCH color token system for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DetectionPage.tsx": "Main page component for paddy disease detection, rendering a hero banner, feature pills, image uploader, and disease result display with analyze/reset logic.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a nature-inspired OKLCH color palette, custom fonts, border radii, shadows, and animations with typography and container-query plugins.",
  "project_state.json": "Tracks the project state (version 13) for a paddy disease detection website, including existing features, known issues, architectural notes, and feature/requirement metadata."
}